monolit/html/common/modules/shop/common/models/Category.php

  public function getBreadcrumbs()
  {
    $breadcrumbs = [];

    $id = $this->parent;
    $cats = [];

    while($cat = $this->find()->where(['id' => $id])->one()){
---
SELECT * FROM `category` WHERE `id` IS NULL