monolit/html/common/modules/shop/common/models/Products.php

  public function getUrl()
  {
    $segments = "";

    $id = $this->category;
    $cats = [];

    while($cat = Category::find()->where(['id' => $id])->one()){
---
SELECT * FROM `category` WHERE `id` IS NULL