monolit/html/frontend/widgets/MenuWidget.php

  public function run()
  {
    $menu = MenuModel::find()->where(['id' => $this->root])->one();
---
SELECT * FROM `menu` WHERE `id`=11