monolit/html/common/models/Blocks.php

    public function getByName($name)
    {
      return Blocks::findOne(['name' => $name])->getTranslations()->one()->value;
---
SELECT * FROM `blocks` WHERE `name`='header_left_label'