monolit/html/common/models/Module.php

SELECT * FROM `module` WHERE (`status`=1) AND (`is_installed`=1)
---
    public static function findAllActive()
    {
        return static::find()->where(['status' => static::STATUS_ACTIVE, 'is_installed' => static::STATE_INSTALLED])->all();