monolit/html/frontend/components/SlugRouteRule.php

SELECT * FROM `routes` WHERE `url`='category1'
---
    public function parseRequest($manager, $request)
    {
        $url = $request->getPathInfo();

        /* index page stored in db as "index" not "" */
        if($url == '') $url = 'index';

        $routeModel = Routes::find()->where(['url' => $url])->one();