monolit/html/common/modules/shop/frontend/controllers/FilterController.php

  public function actionGetFilters($param)
  {
    $data = [];

    foreach(Products::find()->where(['category' => $param])->active()->all() as $product) {
      foreach (Properties::find()->where(['product_id' => $product->id, 'parent' => null])->active()->all() as $property) {
        $data['props'][$property->id]['prop'] = [];
        $data['props'][$property->id]['prop'] = [
          'id' => $property->id,
          'product_id' => $property->product_id,
          'name' => $property->name,
          'value' => $property->value,
        ];

        $data['props'][$property->id]['childs'] = [];
        foreach (Properties::find()->where(['product_id' => $product->id, 'parent' => $property->id])->all() as $prop) {
          array_push($data['props'][$property->id]['childs'], [
            'id' => $prop->id,
            'product_id' => $property->product_id,
            'name' => $prop->name,
            'value' => $prop->value,
          ]);
        }
      }
    }

    $min_price = Products::find()->where(['category' => $param])->orderBy(['price' => SORT_DESC])->active()->one()->price;
    $max_price = Products::find()->where(['category' => $param])->orderBy(['price' => SORT_ASC])->active()->one()->price;
---
SELECT * FROM `properties` WHERE (`product_id`=1) AND (`parent`=2)
SELECT * FROM `products` WHERE (`category`='1') AND (`status`=1) ORDER BY `price` DESC
SELECT * FROM `products` WHERE (`category`='1') AND (`status`=1) ORDER BY `price`